app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `ahsp_master`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `rab_header`
SELECT COUNT(*) AS `numrows`
FROM `rab_header`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `rab_header`
WHERE `status` = 'proses'
SELECT COUNT(*) AS `numrows`
FROM `sumber_daya`
WHERE `jenis` = 'material'
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `sumber_daya`
WHERE `jenis` = 'upah'
AND `is_active` = 1
---
    public function index()
    {
        $ahspModel   = new AhspMasterModel();
        $headerModel = new RabHeaderModel();
        $sdModel     = new SumberDayaModel();

        $data = [
            'title'           => 'Dashboard',
            'total_ahsp'      => $ahspModel->where('is_active', 1)->countAllResults(),
            'total_proyek'    => $headerModel->countAllResults(),
            'proyek_selesai'  => $headerModel->where('status', 'selesai')->countAllResults(),
            'proyek_proses'   => $headerModel->where('status', 'proses')->countAllResults(),
            'total_material'  => $sdModel->where('jenis', 'material')->where('is_active', 1)->countAllResults(),
            'total_upah'      => $sdModel->where('jenis', 'upah')->where('is_active', 1)->countAllResults(),