app/Models/RabHeaderModel.php

SELECT *
FROM `rab_header`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getLatest(int $limit = 10)
    {
        return $this->orderBy('created_at', 'DESC')->findAll($limit);